cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/homebrew-core'
tap 'buo/cask-upgrade'
tap 'tzvetkoff/extras'
tap 'AdoptOpenJDK/openjdk'

brew 'coreutils'
brew 'wget'
brew 'gcc'
brew 'gdb'
brew 'python'
brew 'python3'
brew 'git'
brew 'htop'
brew 'ssh-copy-id'
brew 'cask'
brew 'iftop'
brew 'nload'
brew 'youtube-dl'
brew 'ipmitool'
brew 'figlet'
brew 'im2a'
brew 'ncdu'
brew 'screenfetch'
brew 'watch'
# brew 'mveritym/homebrew-mel/kubedecode'
brew 'tzvetkoff/extras/im2a'

####### DEV #########
#brew 'kubedecode'
#brew 'kubernetes-cli'
#brew 'kubernetes-helm'
#brew 'kompose'
#brew 'postgresql'


# Android
# cask 'android-platform-tools'
# cask 'android-sdk'

# Essentials
cask 'iterm2'
cask 'whatsapp'
cask 'google-chrome'
cask 'the-unarchiver'
cask 'beardedspice'
cask 'osxfuse'

cask 'scroll-reverser'
cask 'teamviewer'
cask 'keepingyouawake'
cask 'nextcloud'
cask 'transmission'

cask 'keepassxc'
cask 'tunnelblick'
cask 'visual-studio-code'
cask 'disk-inventory-x'
cask 'spotify'
cask 'zoom'

cask 'videostream'
cask 'veracrypt'
cask 'vlc'
cask 'hammerspoon'
cask 'borgbackup'
cask 'bartender'
#cask 'google-drive-file-stream'
cask 'karabiner-elements'
cask 'mathpix-snipping-tool'
cask 'google-backup-and-sync'

#==== Devtools =====
# tap 'theeternalsw0rd/telnet'
brew 'mono'
cask 'adoptopenjdk8'
brew 'maven'
# brew 'telnet'
# cask 'vnc-viewer'
cask 'sourcetree'
cask 'intellij-idea'
cask 'pycharm'
# cask 'slack'
cask 'postman'
cask 'docker'
#cask 'jupyter-notebook-ql'
#=======================

#Many dependancies for sshfs, so we do it last.
brew 'sshfs'
