cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'marcusvb/tap'
tap 'homebrew/versions'
tap 'buo/cask-upgrade'


brew 'coreutils'
brew 'findutils', args: ['with-default-names']
brew 'wget'
brew 'gcc'
brew 'gdb'
brew 'valgrind'
brew 'node'
brew 'fish'
brew 'duti'
brew 'python'
brew 'python3'
brew 'git'
brew 'htop'
brew 'ssh-copy-id'
brew 'cask'
brew 'iftop'
brew 'nload'
brew 'youtube-dl'
brew 'ipmitool'
brew 'maven'
brew 'poppler' #pdf editor

#Adding Java8 as dependancy for Android sdk
cask 'caskroom/versions/java8'

# Android
cask 'java'
cask 'android-sdk'
cask 'android-platform-tools'

# Essentials
cask 'iterm2'
cask 'whatsapp'
cask 'avast-security'
cask 'google-chrome'
cask 'the-unarchiver'
cask 'adobe-acrobat-reader'
cask 'alarm-clock'
cask 'beardedspice'
cask 'filezilla'
cask 'osxfuse'
cask 'android-file-transfer'

cask 'my-popcorn-time'
cask 'scroll-reverser'
cask 'teamviewer'
cask 'keepingyouawake'
cask 'skype'
cask 'owncloud'
cask 'telegram'
cask 'transmission'

cask 'xquartz'
cask 'keepassxc'
cask 'tunnelblick'
cask 'visual-studio-code'
cask 'disk-inventory-x'
cask 'gyazo'
cask 'spotify'

cask 'veracrypt'
cask 'vlc'
cask 'etcher'
cask 'hammerspoon'
cask 'borgbackup'
cask 'bartender'

cask 'aerial' #screensaver


#==== ECP/devtools =====
tap 'theeternalsw0rd/telnet'
brew 'mono'
brew 'csc'
brew 'maven'
brew 'telnet'
cask 'real-vnc'
cask 'sourcetree'
cask 'caskroom/versions/java7'
cask 'caskroom/versions/java8'
cask 'caskroom/cask/intellij-idea-ce'
cask 'slack'
#=======================

#Many dependancies for sshfs, so we do it last.
brew 'sshfs'


#===== OLD =========
# cask 'virtualbox'
# cask 'teamspeak-client'
# cask 'cleanmymac'
# cask 'basictex'
# cask 'little-snitch'
# cask 'flux'
# cask 'pb-for-desktop'
#===================
