cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/homebrew-core'
tap 'buo/cask-upgrade'


brew 'coreutils'
brew 'findutils', args: ['with-default-names']
brew 'wget'
brew 'gcc'
brew 'gdb'
brew 'valgrind' #failed
brew 'fish'
brew 'duti' #failed
brew 'python'
brew 'python3'
brew 'git' #using
brew 'htop'
brew 'ssh-copy-id'
brew 'cask'
brew 'iftop'
brew 'nload'
brew 'youtube-dl'
brew 'ipmitool'

# Android
cask 'android-platform-tools'
cask 'android-sdk' #failed

# Essentials
cask 'iterm2'
cask 'whatsapp'
cask 'google-chrome'
cask 'the-unarchiver'
cask 'beardedspice'
cask 'osxfuse'

cask 'scroll-reverser'
cask 'teamviewer'
cask 'keepingyouawake'
cask 'nextcloud'
cask 'transmission'

cask 'keepassxc'
cask 'tunnelblick'
cask 'visual-studio-code'
cask 'disk-inventory-x'
cask 'spotify'

cask 'veracrypt'
cask 'vlc'
cask 'etcher'
cask 'hammerspoon'
cask 'borgbackup'
cask 'bartender'
cask 'google-drive-file-stream'
cask 'karabiner-elements'

#==== ECP/devtools =====
tap 'theeternalsw0rd/telnet'
brew 'mono'
brew 'csc'
cask 'java8' 
brew 'maven' 
brew 'telnet' 
cask 'real-vnc' 
cask 'sourcetree' 
cask 'caskroom/cask/intellij-idea-ce' 
cask 'pycharm-ce'
cask 'slack' 
#=======================

#Many dependancies for sshfs, so we do it last.
brew 'sshfs'
